#### Terraform working directory 🏠: `demo/demo-account/demo-application/ec2`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instances.module.ec2_instance["test-host"].aws_eip_association.this[0] will be created
  + resource "aws_eip_association" "this" {
      + allocation_id        = "eipalloc-00a221db0ea3515af"
      + id                   = (known after apply)
      + instance_id          = "i-023f14edf9194922a"
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
